# MELT IN PANDAS-it is used for reshaping the dataframe in pandas.

In [1]:
import pandas as pd

In [3]:
d1=pd.DataFrame({'Day':[1,2,3],'Eng':[10,17,16],'Math':[12,14,16]})
d1

   Day  Eng  Math
0    1   10    12
1    2   17    14
2    3   16    16

In [4]:
pd.melt(d1)

  variable  value
0      Day      1
1      Day      2
2      Day      3
3      Eng     10
4      Eng     17
5      Eng     16
6     Math     12
7     Math     14
8     Math     16

In [11]:
#PASSING ID-

pd.melt(d1,id_vars='Day')

   Day variable  value
0    1      Eng     10
1    2      Eng     17
2    3      Eng     16
3    1     Math     12
4    2     Math     14
5    3     Math     16

# PIVOT-
In pandas, pivot_table() reshapes data by creating a new table with rows as unique values of one variable
and columns as unique values of another variable, aggregating values using a specified function.

In [ ]:
#PIVOT FUNCTION-IT IS ALSO USED FOR RESHAPING THE DATASET IN PANDAS.

In [14]:
import pandas as pd

data = {
    'Date': ['2024-02-01', '2024-02-01', '2024-02-02', '2024-02-02'],
    'Category': ['A', 'B', 'A', 'B'],
    'Value': [10, 20, 30, 40]
}

df = pd.DataFrame(data)

pivot_df = df.pivot(index='Date', columns='Category', values='Value')

print(pivot_df)

Category     A   B
Date
2024-02-01  10  20
2024-02-02  30  40